using System;


namespace Duin_Geardâl
{
    internal class Программа
    {
        static void Main(string[] args)
        {
            Random random = new Random();

            int длина = random.Next(5, 14);
            int ширина = random.Next(5, 14);

            char[,] комната = new char[ширина, длина];

            //Внешняя часть
            //Заполненіе по длине
            for (int y = 0; y < длина; y++)
            {
                комната[0, y] = комната[ширина - 1, y] = '#';
            }

            //Заполненіе по ширине
            for (int x = 0; x < ширина; x++)
            {
                комната[x, 0] = комната[x, длина - 1] = '#';
            }

            //Выступы
            int КоличествоВозможныхъПреобразованій = random.Next(0, (ширина + длина) / 2 +1);

            while (КоличествоВозможныхъПреобразованій > 0)
            {

                int x = random.Next(0, ширина);
                int y = random.Next(0, длина);

                if (комната[x, y] == '#')
                {

                    ПроверкаСоседнихъКлетокъ(x-1, y-1, комната);
                    ПроверкаСоседнихъКлетокъ(x-1, y, комната);
                    ПроверкаСоседнихъКлетокъ(x, y-1, комната);
                    ПроверкаСоседнихъКлетокъ(x+1, y+1, комната);
                    ПроверкаСоседнихъКлетокъ(x+1, y, комната);
                    ПроверкаСоседнихъКлетокъ(x, y+1, комната);
                    ПроверкаСоседнихъКлетокъ(x+1, y-1, комната);
                    ПроверкаСоседнихъКлетокъ(x-1, y+1, комната);
                    
                    комната[x, y] = '0';
                    КоличествоВозможныхъПреобразованій--;
                }
            }

            //Внутренняя часть
            for (int y = 0; y < длина; y++)
            {
                for (int x = 0; x < ширина; x++)
                {
                    if (комната[x, y] != '#') комната[x, y] = random.Next(101) < 10 ? '#' : ' ';
                }
            }



            // Выводъ Результата
            for (int y = 0; y < длина; y++)
            {
                for (int x = 0; x < ширина; x++)
                {
                    Console.Write(комната[x, y]);
                }
                Console.WriteLine();
            }

            

        }

        static void ПроверкаСоседнихъКлетокъ(int x, int y, char[,] команата)
        {
            if (x >= 1 && x <= команата.GetLength(0) - 2 && y >= 1 && y <= команата.GetLength(1) - 2)
                if (команата[x, y] != '0') команата[x, y] = '#';
        }

    }
}
